In [14]:
import pandas as pd
import numpy as np

df = pd.read_excel('AxisAutoSalesData.xlsx')
df.head()

,Fname,Lname,Gender,Hours Worked,SalesTraining,Years Experience,Cars Sold
0,Jada,Walters,F,39,N,3,2
1,Nicole,Henderson,F,46,N,3,6
2,Tanya,Moore,F,42,Y,4,6
3,Ronelle,Jackson,F,38,Y,5,3
4,Brad,Sears,M,33,N,4,2

In [15]:
#a) average cars sold per month
df['Cars Sold'].mean()

3.9229229229229228

In [16]:
#b) max cars sold per month
df['Cars Sold'].max()

7

In [17]:
#c) min cars sold per month
df['Cars Sold'].min()

1

In [18]:
#d) average cars sold per month by gender
pd.pivot_table(df, index = 'Gender', values='Cars Sold', aggfunc='mean')

        Cars Sold
Gender
F        3.760736
M        4.078431

In [19]:
#e) average hours worked by people selling > 3 cars per month
df.loc[df['Cars Sold']>3, 'Cars per Month']=1
df.loc[df['Cars Sold']<=3, 'Cars per Month']=0

In [20]:
pd.pivot_table(df, index = 'Cars per Month', values='Hours Worked', aggfunc='mean')

                Hours Worked
Cars per Month
0.0                32.273171
1.0                34.740238

In [13]:
df[df['Cars Sold']>3]
#no need to do the pivot table here

,Fname,Lname,Gender,Hours Worked,SalesTraining,Years Experience,Cars Sold,Cars per Month
0,Jada,Walters,F,39,N,3,2,0.0
1,Nicole,Henderson,F,46,N,3,6,1.0
2,Tanya,Moore,F,42,Y,4,6,1.0
3,Ronelle,Jackson,F,38,Y,5,3,0.0
4,Brad,Sears,M,33,N,4,2,0.0

In [21]:
#f) average years of experience
df['Years Experience'].mean()

3.026026026026026

In [22]:
#g) average years of experience for people selling > 3 cars per month
pd.pivot_table(df, index = 'Cars per Month', values='Years Experience', aggfunc='mean')

                Years Experience
Cars per Month
0.0                     2.992683
1.0                     3.049236

In [26]:
#h) average cars sold per month by whether or not they have had sales training
df['hasTraining'] = np.where(df['SalesTraining']=='Y',1,0)
pd.pivot_table(df, index = 'hasTraining', values='Cars Sold', aggfunc='mean')

             Cars Sold
hasTraining
0             3.573850
1             4.168942

In [ ]:
#i) What do you think is the best indicator of whether someone is a good salesperson?
#sales training